Revit 2026 API

# FilterCategoryRuleAllCategoriesFilterable Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool AllCategoriesFilterable(
	ICollection<ElementId> categories
)
```
```vb
Public Shared Function AllCategoriesFilterable (
	categories As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
static bool AllCategoriesFilterable(
	ICollection<ElementId^>^ categories
)
```
```fsharp
static member AllCategoriesFilterable :
        categories : ICollection<ElementId> -> bool
```

#### Parameters

categories ICollectionElementId

#### Return Value

Boolean

#### Reference

FilterCategoryRule Class

Autodesk.Revit.DB Namespace